app/Controllers/Dosen.php

public function index()
{
        if (!session()->has('username')) {
            return redirect('Login::index');
        }
    //model initialize
    $DataDosen = new DosenModel();
    $pager = \Config\Services::pager();

    $data = array(
        'DataDosen' => $DataDosen->paginate(10, 'dosen'),
        'pager' => $DataDosen->pager
    );
---
SELECT *
FROM `dosen`
 LIMIT 10