app/Controllers/Dosen.php

SELECT *
FROM `dosen`
 LIMIT 2
SELECT COUNT(*) AS `numrows`
FROM `dosen`
---
public function index()
{
    //model initialize
    $DataDosen = new DosenModel();
    $pager = \Config\Services::pager();

    $data = array(
        'DataDosen' => $DataDosen->paginate(2, 'dosen'),
        'pager' => $DataDosen->pager
    );

INSERT INTO `dosen` (`kode_dosen`, `nama_dosen`, `status_dosen`) VALUES ('003', 'Renal', '0')
---
public function store()
{
    $DataDosen = new DosenModel();
    $data = $this->request->getPost();
    $rules = [
        'kode_dosen'=>'required',
        'nama_dosen'=>'required',
        'status_dosen'=>'required',
    ];
    if (!$this->validateData($data, $rules)) {
      return redirect()->back()->with('message', $this->validator->getErrors());
    }
    $DataDosen->save($this->request->getPost());