app/Controllers/Login.php

    public function process()
    {
        $users = new UsersModel();
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');
        $rules = [
            'username' => 'required',
            'password' => 'required',
        ];
        if (!$this->validateData($this->request->getPost(), $rules)) {
            return redirect()->back()->with('error', $this->validator->getErrors());
        }
        $dataUser = $users->where([
            'username' => $username,
        ])->first();
---
SELECT *
FROM `users`
WHERE `username` = 'abas'
 LIMIT 1