app/Controllers/Register.php

INSERT INTO `users` (`username`, `password`, `name`, `created_at`, `updated_at`) VALUES ('holiq', '$2y$10$W1.HwUxQmpRzJKHoRrtsp.TcVVWoA26BZxXt5l8SxjiuH439TaZ4C', 'Holiq', '2024-04-03 06:22:08', '2024-04-03 06:22:08')
---
            return redirect()->back()->withInput();
        }
        $users = new UsersModel();
        $users->insert([
            'username' => $this->request->getVar('username'),
            'password' => password_hash($this->request->getVar('password'), PASSWORD_BCRYPT),
            'name' => $this->request->getVar('name')
        ]);