app/Controllers/Transaksi.php

SELECT COUNT(*) AS `numrows`
FROM `tjual`
JOIN `tcustomer` ON `tjual`.`id_cust` = `tcustomer`.`id_cust`
SELECT `tjual`.*, `tcustomer`.`nama_cust`
FROM `tjual`
JOIN `tcustomer` ON `tjual`.`id_cust` = `tcustomer`.`id_cust`
 LIMIT 5
SELECT `tjual_detil`.*, `tbarang`.`nama_barang`
FROM `tjual_detil`
JOIN `tbarang` ON `tbarang`.`id_barang` = `tjual_detil`.`id_barang`
WHERE `tjual_detil`.`id_jual` = '24'
---
    public function index ()
    {

        if (!session()->has('username')) {
            return redirect('Login::index');
        }
        $transaksis = $this->transaksi
            ->select('tjual.*, tcustomer.nama_cust')
            ->join('tcustomer', 'tjual.id_cust = tcustomer.id_cust')
            ->paginate(5, 'transaksi');

        foreach ($transaksis as &$row) {
            $row['details'] = $this->detailTransaksi
                ->select('tjual_detil.*, tbarang.nama_barang ')
                ->join('tbarang', 'tbarang.id_barang = tjual_detil.id_barang')
                ->where('tjual_detil.id_jual', $row['id_jual'])
                ->findAll();